УТ_для_edt.РасширениеСмарт/src/Documents/КорректировкаНазначенияТоваров/КорректировкаНазначенияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5bac1b80-f1c2-4ab0-9dbc-8938564087cd">
  <name>КорректировкаНазначенияТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="39a7f699-bbb3-43f2-96bc-c47b86b5f072">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="42bb455c-c7f7-4561-a2ec-57cb8604dca3">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Назначения/Назначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Назначения</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ДвиженияПоСкладскимРегистрам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипНазначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтролироватьТолькоНаличие</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Documents/КорректировкаНазначенияТоваров/ManagerModule.bsl
&ИзменениеИКонтроль("МакетФормыВыбораНазначений")
Функция смарт_МакетФормыВыбораНазначений()

	МакетФормы = Справочники.Назначения.МакетФормыВыбораНазначений();

	ШаблонНазначения = Справочники.Назначения.ДобавитьШаблонНазначений(МакетФормы);
	ШаблонНазначения.ТипыНазначений.Удалить(ШаблонНазначения.ТипыНазначений.Найти(Перечисления.ТипыНазначений.ДавальческоеПродукция22));

	// Остатки списываемых товаров на складе.
	ОписаниеКолонок = Справочники.Назначения.ДобавитьОписаниеКолонок(МакетФормы, "ОбеспечениеЗаказов", Истина, "Объект.Товары.ИсходноеНазначение", "ВНаличии");
	ОписаниеКолонок.Колонки.НайтиПоЗначению("ВНаличии").Пометка = Истина;

	ОписаниеКолонок.ПутиКДанным.Номенклатура     = "Объект.Товары.Номенклатура";
	ОписаниеКолонок.ПутиКДанным.Характеристика   = "Объект.Товары.Характеристика";
	ОписаниеКолонок.ПутиКДанным.Склад            = "Объект.Товары.Склад";

	// Потребности в оприходуемых товарах на складе.
	ОписаниеКолонок = Справочники.Назначения.ДобавитьОписаниеКолонок(МакетФормы, "ОбеспечениеЗаказов", Истина, "Объект.Товары.НовоеНазначение", "Потребность");
	ОписаниеКолонок.Колонки.НайтиПоЗначению("Потребность").Пометка = Истина;

	ОписаниеКолонок.ПутиКДанным.Номенклатура     = "Объект.Товары.Номенклатура";
	ОписаниеКолонок.ПутиКДанным.Характеристика   = "Объект.Товары.Характеристика";
	ОписаниеКолонок.ПутиКДанным.Склад            = "Объект.Товары.Склад";
	#Вставка
	//++ #5030 смарт: Тимофеева 02.02.26 / Выведенные из оборота товары,  контроль остатков и разделение списка
	ОписаниеКолонок.ПутиКДанным.Вставить("Серия", "Объект.Товары.Серия");
	//-- #5030 смарт: Тимофеева 02.02.26
	#КонецВставки

	Возврат МакетФормы;

КонецФункции

//++ #5798 смарт: Тимофеева 18.02.26 / Выведенные из оборота товары. Представление документа в отчетах
&Вместо("ОбработкаПолученияПолейПредставления")
Процедура смарт_ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("смартОперацияВводаВыводаИзОборота");
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
КонецПроцедуры

&Вместо("ОбработкаПолученияПредставления")
Процедура смарт_ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если Данные.смартОперацияВводаВыводаИзОборота = Перечисления.смартОперацииВводаВыводаТоваровИзОборота.ВыводИзОборота Тогда
		ИмяДокумента = НСтр("ru = 'Вывод товара из оборота'");
	ИначеЕсли Данные.смартОперацияВводаВыводаИзОборота = Перечисления.смартОперацииВводаВыводаТоваровИзОборота.ВводВОборот Тогда
		ИмяДокумента = НСтр("ru = 'Возврат товара в оборот'");
	Иначе
		ИмяДокумента = НСтр("ru = 'Корректировка назначения товаров'");	
	КонецЕсли;
	
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 %2 от %3'"),
		ИмяДокумента,
		Данные.Номер,
		Данные.Дата);
КонецПроцедуры
//++ #5798 смарт: Тимофеева 18.02.26

#Область Назначения

//++ #5030 смарт: Тимофеева 02.02.26 / Выведенные из оборота товары,  контроль остатков и разделение списка
// Возврашает шаблон для генерации назначения товаров в документе.
//
// Параметры:
// 		Объект - ДокументОбъект.ЗаказКлиента, ДанныеФормыСтруктура - заказ клиента, по которому необходимо получить шаблон назначения.
//
// Возвращаемое значение:
// 		Структура - (см. функцию Справочники.Назначения.ШаблонНового).
//
Функция ШаблонНазначения(Объект, Назначение, Номенклатура, Серия) Экспорт
	
	ШаблонНазначения = Справочники.Назначения.ШаблонНового();
	ШаблонНазначения.Заказ = Объект.Ссылка;
	ЗаполнитьЗначенияСвойств(ШаблонНазначения, Назначение, "ТипНазначения, смартПричинаВыводаИзОборота, смартУточнениеПричиныВыводаИзОборота");
	ШаблонНазначения.смартВыведеннаяИзОборотаНоменклатура = Номенклатура;
	ШаблонНазначения.смартВыведеннаяИзОборотаСерия = Серия;
	Возврат ШаблонНазначения;
	
КонецФункции
//-- #5030 смарт: Тимофеева 02.02.26 

#КонецОбласти
